text1 = """
Как поэт Высоцкий реализовал себя, прежде всего, в жанре
авторской песни. Первые из написанных им произведений относятся
к началу 1960-х годов. Вначале они исполнялись в кругу друзей,
позже получили широкую известность благодаря распространявшимся
по стране магнитофонным записям. Поэзия Высоцкого отличалась
многообразием тем (уличные, лагерные, военные, сатирические,
бытовые, сказочные, «спортивные» песни), остротой смыслового
подтекста и акцентированной социально-нравственной позицией
автора. В его произведениях, рассказывающих о внутреннем
выборе людей, поставленных в экстремальные обстоятельства,
прослеживались экзистенциальные мотивы. Творческая эволюция
Высоцкого прошла в несколько этапов. В его раннем творчестве
преобладали уличные и дворовые песни. С середины 1960-х годов
тематика произведений начала расширяться, а песенные циклы —
складываться в новую «энциклопедию русской жизни».
В 1970-х годах значительную часть творчества Высоцкого
составляли песни и стихотворения исповедально-философского характера,
поэт часто обращался к вечным вопросам бытия.
"""
russkie_bukvi = "йцукенгшщзхъфывапролджэячсмитьбю"